espressif/arduino-esp32/boards.txt
##############################################################

nina_w10.name=u-blox NINA-W10 series (ESP32)

nina_w10.upload.tool=esptool_py
nina_w10.upload.maximum_size=1310720
nina_w10.upload.maximum_data_size=327680
nina_w10.upload.wait_for_upload_port=true

nina_w10.serial.disableDTR=true
nina_w10.serial.disableRTS=true

nina_w10.build.mcu=esp32
nina_w10.build.core=esp32
nina_w10.build.variant=nina_w10
nina_w10.build.board=UBLOX_NINA_W10
nina_w10.build.f_cpu=240000000L
nina_w10.build.boot=dio
nina_w10.build.partitions=minimal
nina_w10.build.flash_mode=dio
nina_w10.build.flash_size=2MB
nina_w10.build.flash_freq=40m
nina_w10.build.defines=

nina_w10.menu.UploadSpeed.921600=921600
nina_w10.menu.UploadSpeed.921600.upload.speed=921600
nina_w10.menu.UploadSpeed.115200=115200
nina_w10.menu.UploadSpeed.115200.upload.speed=115200
nina_w10.menu.UploadSpeed.256000.windows=256000
nina_w10.menu.UploadSpeed.256000.upload.speed=256000
nina_w10.menu.UploadSpeed.230400.windows.upload.speed=256000
nina_w10.menu.UploadSpeed.230400=230400
nina_w10.menu.UploadSpeed.230400.upload.speed=230400
nina_w10.menu.UploadSpeed.460800.linux=460800
nina_w10.menu.UploadSpeed.460800.macosx=460800
nina_w10.menu.UploadSpeed.460800.upload.speed=460800
nina_w10.menu.UploadSpeed.512000.windows=512000
nina_w10.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

widora-air.name=Widora AIR

widora-air.upload.tool=esptool_py
widora-air.upload.maximum_size=1310720
widora-air.upload.maximum_data_size=327680
widora-air.upload.wait_for_upload_port=true

widora-air.serial.disableDTR=true
widora-air.serial.disableRTS=true

widora-air.build.mcu=esp32
widora-air.build.core=esp32
widora-air.build.variant=widora-air
widora-air.build.board=WIDORA_AIR

widora-air.build.f_cpu=240000000L
widora-air.build.flash_mode=dio
widora-air.build.flash_size=16MB
widora-air.build.boot=dio
widora-air.build.partitions=default
widora-air.build.defines=

widora-air.menu.FlashFreq.80=80MHz
widora-air.menu.FlashFreq.80.build.flash_freq=80m
widora-air.menu.FlashFreq.40=40MHz
widora-air.menu.FlashFreq.40.build.flash_freq=40m

widora-air.menu.UploadSpeed.921600=921600
widora-air.menu.UploadSpeed.921600.upload.speed=921600
widora-air.menu.UploadSpeed.115200=115200
widora-air.menu.UploadSpeed.115200.upload.speed=115200
widora-air.menu.UploadSpeed.256000.windows=256000
widora-air.menu.UploadSpeed.256000.upload.speed=256000
widora-air.menu.UploadSpeed.230400.windows.upload.speed=256000
widora-air.menu.UploadSpeed.230400=230400
widora-air.menu.UploadSpeed.230400.upload.speed=230400
widora-air.menu.UploadSpeed.460800.linux=460800
widora-air.menu.UploadSpeed.460800.macosx=460800
widora-air.menu.UploadSpeed.460800.upload.speed=460800
widora-air.menu.UploadSpeed.512000.windows=512000
widora-air.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

esp320.name=Electronic SweetPeas - ESP320

esp320.upload.tool=esptool_py
esp320.upload.maximum_size=1310720
esp320.upload.maximum_data_size=327680
esp320.upload.wait_for_upload_port=true

esp320.serial.disableDTR=true
esp320.serial.disableRTS=true

esp320.build.mcu=esp32
esp320.build.core=esp32
esp320.build.variant=esp320
esp320.build.board=ESP320

esp320.build.f_cpu=240000000L
esp320.build.flash_mode=qio
esp320.build.flash_size=4MB
esp320.build.boot=dio
esp320.build.partitions=default
esp320.build.defines=

esp320.menu.FlashFreq.80=80MHz
esp320.menu.FlashFreq.80.build.flash_freq=80m
esp320.menu.FlashFreq.40=40MHz
esp320.menu.FlashFreq.40.build.flash_freq=40m

esp320.menu.UploadSpeed.921600=921600
esp320.menu.UploadSpeed.921600.upload.speed=921600
esp320.menu.UploadSpeed.115200=115200
esp320.menu.UploadSpeed.115200.upload.speed=115200
esp320.menu.UploadSpeed.256000.windows=256000
esp320.menu.UploadSpeed.256000.upload.speed=256000
esp320.menu.UploadSpeed.230400.windows.upload.speed=256000
esp320.menu.UploadSpeed.230400=230400
esp320.menu.UploadSpeed.230400.upload.speed=230400
esp320.menu.UploadSpeed.460800.linux=460800
esp320.menu.UploadSpeed.460800.macosx=460800
esp320.menu.UploadSpeed.460800.upload.speed=460800
esp320.menu.UploadSpeed.512000.windows=512000
esp320.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

nano32.name=Nano32

nano32.upload.tool=esptool_py
nano32.upload.maximum_size=1310720
nano32.upload.maximum_data_size=327680
nano32.upload.wait_for_upload_port=true

nano32.serial.disableDTR=true
nano32.serial.disableRTS=true

nano32.build.mcu=esp32
nano32.build.core=esp32
nano32.build.variant=nano32
nano32.build.board=NANO32

nano32.build.f_cpu=240000000L
nano32.build.flash_mode=dio
nano32.build.flash_size=4MB
nano32.build.boot=dio
nano32.build.partitions=default
nano32.build.defines=

nano32.menu.FlashFreq.80=80MHz
nano32.menu.FlashFreq.80.build.flash_freq=80m
nano32.menu.FlashFreq.40=40MHz
nano32.menu.FlashFreq.40.build.flash_freq=40m

nano32.menu.UploadSpeed.921600=921600
nano32.menu.UploadSpeed.921600.upload.speed=921600
nano32.menu.UploadSpeed.115200=115200
nano32.menu.UploadSpeed.115200.upload.speed=115200
nano32.menu.UploadSpeed.256000.windows=256000
nano32.menu.UploadSpeed.256000.upload.speed=256000
nano32.menu.UploadSpeed.230400.windows.upload.speed=256000
nano32.menu.UploadSpeed.230400=230400
nano32.menu.UploadSpeed.230400.upload.speed=230400
nano32.menu.UploadSpeed.460800.linux=460800
nano32.menu.UploadSpeed.460800.macosx=460800
nano32.menu.UploadSpeed.460800.upload.speed=460800
nano32.menu.UploadSpeed.512000.windows=512000
nano32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

d32.name=LOLIN D32

d32.upload.tool=esptool_py
d32.upload.maximum_size=1310720
d32.upload.maximum_data_size=327680
d32.upload.wait_for_upload_port=true

d32.serial.disableDTR=true
d32.serial.disableRTS=true

d32.build.mcu=esp32
d32.build.core=esp32
d32.build.variant=d32
d32.build.board=LOLIN_D32

d32.build.f_cpu=240000000L
d32.build.flash_size=4MB
d32.build.flash_freq=40m
d32.build.flash_mode=dio
d32.build.boot=dio
d32.build.partitions=default
d32.build.defines=

