espressif/arduino-esp32/boards.txt
alksesp32.menu.FlashMode.qio=QIO
alksesp32.menu.FlashMode.qio.build.flash_mode=dio
alksesp32.menu.FlashMode.qio.build.boot=qio
alksesp32.menu.FlashMode.dio=DIO
alksesp32.menu.FlashMode.dio.build.flash_mode=dio
alksesp32.menu.FlashMode.dio.build.boot=dio
alksesp32.menu.FlashMode.qout=QOUT
alksesp32.menu.FlashMode.qout.build.flash_mode=dout
alksesp32.menu.FlashMode.qout.build.boot=qout
alksesp32.menu.FlashMode.dout=DOUT
alksesp32.menu.FlashMode.dout.build.flash_mode=dout
alksesp32.menu.FlashMode.dout.build.boot=dout

alksesp32.menu.FlashFreq.80=80MHz
alksesp32.menu.FlashFreq.80.build.flash_freq=80m
alksesp32.menu.FlashFreq.40=40MHz
alksesp32.menu.FlashFreq.40.build.flash_freq=40m

alksesp32.menu.FlashSize.4M=4MB (32Mb)
alksesp32.menu.FlashSize.4M.build.flash_size=4MB
alksesp32.menu.FlashSize.2M=2MB (16Mb)
alksesp32.menu.FlashSize.2M.build.flash_size=2MB
alksesp32.menu.FlashSize.2M.build.partitions=minimal
alksesp32.menu.FlashSize.16M=16MB (128Mb)
alksesp32.menu.FlashSize.16M.build.flash_size=16MB
alksesp32.menu.FlashSize.16M.build.partitions=ffat

alksesp32.menu.UploadSpeed.921600=921600
alksesp32.menu.UploadSpeed.921600.upload.speed=921600
alksesp32.menu.UploadSpeed.115200=115200
alksesp32.menu.UploadSpeed.115200.upload.speed=115200
alksesp32.menu.UploadSpeed.256000.windows=256000
alksesp32.menu.UploadSpeed.256000.upload.speed=256000
alksesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
alksesp32.menu.UploadSpeed.230400=230400
alksesp32.menu.UploadSpeed.230400.upload.speed=230400
alksesp32.menu.UploadSpeed.460800.linux=460800
alksesp32.menu.UploadSpeed.460800.macosx=460800
alksesp32.menu.UploadSpeed.460800.upload.speed=460800
alksesp32.menu.UploadSpeed.512000.windows=512000
alksesp32.menu.UploadSpeed.512000.upload.speed=512000

alksesp32.menu.DebugLevel.none=None
alksesp32.menu.DebugLevel.none.build.code_debug=0
alksesp32.menu.DebugLevel.error=Error
alksesp32.menu.DebugLevel.error.build.code_debug=1
alksesp32.menu.DebugLevel.warn=Warn
alksesp32.menu.DebugLevel.warn.build.code_debug=2
alksesp32.menu.DebugLevel.info=Info
alksesp32.menu.DebugLevel.info.build.code_debug=3
alksesp32.menu.DebugLevel.debug=Debug
alksesp32.menu.DebugLevel.debug.build.code_debug=4
alksesp32.menu.DebugLevel.verbose=Verbose
alksesp32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################


wipy3.name=WiPy 3.0

wipy3.upload.tool=esptool_py
wipy3.upload.maximum_size=1310720
wipy3.upload.maximum_data_size=294912
wipy3.upload.wait_for_upload_port=true

wipy3.serial.disableDTR=true
wipy3.serial.disableRTS=true

wipy3.build.mcu=esp32
wipy3.build.core=esp32
wipy3.build.variant=wipy3
wipy3.build.board=WIPY3

wipy3.build.f_cpu=240000000L
wipy3.build.flash_mode=dio
wipy3.build.flash_size=8MB
wipy3.build.boot=dio
wipy3.build.partitions=default
wipy3.build.defines=

wipy3.menu.FlashFreq.80=80MHz
wipy3.menu.FlashFreq.80.build.flash_freq=80m
wipy3.menu.FlashFreq.40=40MHz
wipy3.menu.FlashFreq.40.build.flash_freq=40m

wipy3.menu.UploadSpeed.921600=921600
wipy3.menu.UploadSpeed.921600.upload.speed=921600
wipy3.menu.UploadSpeed.115200=115200
wipy3.menu.UploadSpeed.115200.upload.speed=115200
wipy3.menu.UploadSpeed.256000.windows=256000
wipy3.menu.UploadSpeed.256000.upload.speed=256000
wipy3.menu.UploadSpeed.230400.windows.upload.speed=256000
wipy3.menu.UploadSpeed.230400=230400
wipy3.menu.UploadSpeed.230400.upload.speed=230400
wipy3.menu.UploadSpeed.460800.linux=460800
wipy3.menu.UploadSpeed.460800.macosx=460800
wipy3.menu.UploadSpeed.460800.upload.speed=460800
wipy3.menu.UploadSpeed.512000.windows=512000
wipy3.menu.UploadSpeed.512000.upload.speed=512000

wipy3.menu.DebugLevel.none=None
wipy3.menu.DebugLevel.none.build.code_debug=0
wipy3.menu.DebugLevel.error=Error
wipy3.menu.DebugLevel.error.build.code_debug=1
wipy3.menu.DebugLevel.warn=Warn
wipy3.menu.DebugLevel.warn.build.code_debug=2
wipy3.menu.DebugLevel.info=Info
wipy3.menu.DebugLevel.info.build.code_debug=3
wipy3.menu.DebugLevel.debug=Debug
wipy3.menu.DebugLevel.debug.build.code_debug=4
wipy3.menu.DebugLevel.verbose=Verbose
wipy3.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

bpi-bit.name=BPI-BIT

bpi-bit.upload.tool=esptool_py
bpi-bit.upload.maximum_size=1310720
bpi-bit.upload.maximum_data_size=294912
bpi-bit.upload.wait_for_upload_port=true

bpi-bit.serial.disableDTR=true
bpi-bit.serial.disableRTS=true

bpi-bit.build.mcu=esp32
bpi-bit.build.core=esp32
bpi-bit.build.variant=bpi-bit
bpi-bit.build.board=BPI-BIT

bpi-bit.build.f_cpu=160000000L
bpi-bit.build.flash_mode=dio
bpi-bit.build.flash_size=4MB
bpi-bit.build.boot=dio
bpi-bit.build.partitions=default

bpi-bit.menu.FlashFreq.80=80MHz
bpi-bit.menu.FlashFreq.80.build.flash_freq=80m
bpi-bit.menu.FlashFreq.40=40MHz
bpi-bit.menu.FlashFreq.40.build.flash_freq=40m

bpi-bit.menu.UploadSpeed.921600=921600
bpi-bit.menu.UploadSpeed.921600.upload.speed=921600
bpi-bit.menu.UploadSpeed.115200=115200
bpi-bit.menu.UploadSpeed.115200.upload.speed=115200
bpi-bit.menu.UploadSpeed.256000.windows=256000
bpi-bit.menu.UploadSpeed.256000.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400.windows.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400=230400
bpi-bit.menu.UploadSpeed.230400.upload.speed=230400
bpi-bit.menu.UploadSpeed.460800.linux=460800
bpi-bit.menu.UploadSpeed.460800.macosx=460800
bpi-bit.menu.UploadSpeed.460800.upload.speed=460800
bpi-bit.menu.UploadSpeed.512000.windows=512000
bpi-bit.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

wesp32.name=Silicognition wESP32

wesp32.upload.tool=esptool_py
wesp32.upload.maximum_size=1310720
wesp32.upload.maximum_data_size=327680
wesp32.upload.wait_for_upload_port=true

wesp32.serial.disableDTR=true
wesp32.serial.disableRTS=true

wesp32.build.mcu=esp32
wesp32.build.core=esp32
wesp32.build.variant=wesp32
wesp32.build.board=WESP32

wesp32.build.f_cpu=240000000L
wesp32.build.flash_mode=dio
wesp32.build.flash_size=4MB
wesp32.build.boot=dio
wesp32.build.partitions=default
wesp32.build.defines=

