espressif/arduino-esp32/boards.txt
##############################################################

mgbot-iotik32b.name=MGBOT IOTIK 32B

mgbot-iotik32b.upload.tool=esptool_py
mgbot-iotik32b.upload.maximum_size=1310720
mgbot-iotik32b.upload.maximum_data_size=327680
mgbot-iotik32b.upload.wait_for_upload_port=true

mgbot-iotik32b.serial.disableDTR=true
mgbot-iotik32b.serial.disableRTS=true

mgbot-iotik32b.build.mcu=esp32
mgbot-iotik32b.build.core=esp32
mgbot-iotik32b.build.variant=mgbot-iotik32b
mgbot-iotik32b.build.board=MGBOT_IOTIK32B

mgbot-iotik32b.build.f_cpu=240000000L
mgbot-iotik32b.build.flash_size=4MB
mgbot-iotik32b.build.flash_freq=40m
mgbot-iotik32b.build.flash_mode=dio
mgbot-iotik32b.build.boot=dio
mgbot-iotik32b.build.partitions=default
mgbot-iotik32b.build.defines=

mgbot-iotik32b.menu.PSRAM.disabled=Disabled
mgbot-iotik32b.menu.PSRAM.disabled.build.defines=
mgbot-iotik32b.menu.PSRAM.enabled=Enabled
mgbot-iotik32b.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

mgbot-iotik32b.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
mgbot-iotik32b.menu.PartitionScheme.default.build.partitions=default
mgbot-iotik32b.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
mgbot-iotik32b.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
mgbot-iotik32b.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
mgbot-iotik32b.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
mgbot-iotik32b.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
mgbot-iotik32b.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
mgbot-iotik32b.menu.PartitionScheme.minimal.build.partitions=minimal
mgbot-iotik32b.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
mgbot-iotik32b.menu.PartitionScheme.no_ota.build.partitions=no_ota
mgbot-iotik32b.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mgbot-iotik32b.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
mgbot-iotik32b.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
mgbot-iotik32b.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
mgbot-iotik32b.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
mgbot-iotik32b.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
mgbot-iotik32b.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
mgbot-iotik32b.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
mgbot-iotik32b.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
mgbot-iotik32b.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
mgbot-iotik32b.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
mgbot-iotik32b.menu.PartitionScheme.huge_app.build.partitions=huge_app
mgbot-iotik32b.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
mgbot-iotik32b.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
mgbot-iotik32b.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mgbot-iotik32b.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
mgbot-iotik32b.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
mgbot-iotik32b.menu.PartitionScheme.fatflash.build.partitions=ffat
mgbot-iotik32b.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
mgbot-iotik32b.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
mgbot-iotik32b.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
mgbot-iotik32b.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

mgbot-iotik32b.menu.CPUFreq.240=240MHz (WiFi/BT)
mgbot-iotik32b.menu.CPUFreq.240.build.f_cpu=240000000L
mgbot-iotik32b.menu.CPUFreq.160=160MHz (WiFi/BT)
mgbot-iotik32b.menu.CPUFreq.160.build.f_cpu=160000000L
mgbot-iotik32b.menu.CPUFreq.80=80MHz (WiFi/BT)
mgbot-iotik32b.menu.CPUFreq.80.build.f_cpu=80000000L
mgbot-iotik32b.menu.CPUFreq.40=40MHz (40MHz XTAL)
mgbot-iotik32b.menu.CPUFreq.40.build.f_cpu=40000000L
mgbot-iotik32b.menu.CPUFreq.26=26MHz (26MHz XTAL)
mgbot-iotik32b.menu.CPUFreq.26.build.f_cpu=26000000L
mgbot-iotik32b.menu.CPUFreq.20=20MHz (40MHz XTAL)
mgbot-iotik32b.menu.CPUFreq.20.build.f_cpu=20000000L
mgbot-iotik32b.menu.CPUFreq.13=13MHz (26MHz XTAL)
mgbot-iotik32b.menu.CPUFreq.13.build.f_cpu=13000000L
mgbot-iotik32b.menu.CPUFreq.10=10MHz (40MHz XTAL)
mgbot-iotik32b.menu.CPUFreq.10.build.f_cpu=10000000L

mgbot-iotik32b.menu.FlashMode.qio=QIO
mgbot-iotik32b.menu.FlashMode.qio.build.flash_mode=dio
mgbot-iotik32b.menu.FlashMode.qio.build.boot=qio
mgbot-iotik32b.menu.FlashMode.dio=DIO
mgbot-iotik32b.menu.FlashMode.dio.build.flash_mode=dio
mgbot-iotik32b.menu.FlashMode.dio.build.boot=dio
mgbot-iotik32b.menu.FlashMode.qout=QOUT
mgbot-iotik32b.menu.FlashMode.qout.build.flash_mode=dout
mgbot-iotik32b.menu.FlashMode.qout.build.boot=qout
mgbot-iotik32b.menu.FlashMode.dout=DOUT
mgbot-iotik32b.menu.FlashMode.dout.build.flash_mode=dout
mgbot-iotik32b.menu.FlashMode.dout.build.boot=dout

mgbot-iotik32b.menu.FlashFreq.80=80MHz
mgbot-iotik32b.menu.FlashFreq.80.build.flash_freq=80m
mgbot-iotik32b.menu.FlashFreq.40=40MHz
mgbot-iotik32b.menu.FlashFreq.40.build.flash_freq=40m

mgbot-iotik32b.menu.FlashSize.4M=4MB (32Mb)
mgbot-iotik32b.menu.FlashSize.4M.build.flash_size=4MB
mgbot-iotik32b.menu.FlashSize.8M=8MB (64Mb)
mgbot-iotik32b.menu.FlashSize.8M.build.flash_size=8MB
mgbot-iotik32b.menu.FlashSize.8M.build.partitions=default_8MB
mgbot-iotik32b.menu.FlashSize.2M=2MB (16Mb)
mgbot-iotik32b.menu.FlashSize.2M.build.flash_size=2MB
mgbot-iotik32b.menu.FlashSize.2M.build.partitions=minimal
mgbot-iotik32b.menu.FlashSize.16M=16MB (128Mb)
mgbot-iotik32b.menu.FlashSize.16M.build.flash_size=16MB

mgbot-iotik32b.menu.UploadSpeed.921600=921600
mgbot-iotik32b.menu.UploadSpeed.921600.upload.speed=921600
mgbot-iotik32b.menu.UploadSpeed.115200=115200
mgbot-iotik32b.menu.UploadSpeed.115200.upload.speed=115200
mgbot-iotik32b.menu.UploadSpeed.256000.windows=256000
mgbot-iotik32b.menu.UploadSpeed.256000.upload.speed=256000
mgbot-iotik32b.menu.UploadSpeed.230400.windows.upload.speed=256000
mgbot-iotik32b.menu.UploadSpeed.230400=230400
mgbot-iotik32b.menu.UploadSpeed.230400.upload.speed=230400
mgbot-iotik32b.menu.UploadSpeed.460800.linux=460800
mgbot-iotik32b.menu.UploadSpeed.460800.macosx=460800
mgbot-iotik32b.menu.UploadSpeed.460800.upload.speed=460800
mgbot-iotik32b.menu.UploadSpeed.512000.windows=512000
mgbot-iotik32b.menu.UploadSpeed.512000.upload.speed=512000

mgbot-iotik32b.menu.DebugLevel.none=None
mgbot-iotik32b.menu.DebugLevel.none.build.code_debug=0
mgbot-iotik32b.menu.DebugLevel.error=Error
mgbot-iotik32b.menu.DebugLevel.error.build.code_debug=1
mgbot-iotik32b.menu.DebugLevel.warn=Warn
mgbot-iotik32b.menu.DebugLevel.warn.build.code_debug=2
mgbot-iotik32b.menu.DebugLevel.info=Info
mgbot-iotik32b.menu.DebugLevel.info.build.code_debug=3
mgbot-iotik32b.menu.DebugLevel.debug=Debug
mgbot-iotik32b.menu.DebugLevel.debug.build.code_debug=4
mgbot-iotik32b.menu.DebugLevel.verbose=Verbose
mgbot-iotik32b.menu.DebugLevel.verbose.build.code_debug=5

